In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('seat')

+----+---------+
| id | student |
+----+---------+
| 1  |  Abbot  |
| 2  |  Doris  |
| 3  | Emerson |
| 4  |  Green  |
| 5  |  Jeames |
+----+---------+

### Write an SQL query to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.

#### *Return the result table ordered by id in ascending order.*
```
+----+---------+
| id | student |
+----+---------+
| 1  | Doris   |
| 2  | Abbot   |
| 3  | Green   |
| 4  | Emerson |
| 5  | Jeames  |
+----+---------+
Explanation: 
Note that if the number of students is odd, there is no need to change the last one's seat.
```

In [6]:
%%sql 

SELECT 
    CASE WHEN id % 2 != 0 THEN id + 1 ELSE id - 1 END AS id, 
    student
FROM Seat 
WHERE id NOT IN (SELECT MAX(id) FROM Seat)
ORDER BY id;

[(1, 'Doris'), (2, 'Abbot'), (3, 'Green'), (4, 'Emerson')]

In [8]:
%%sql 

(SELECT 
    CASE WHEN id % 2 != 0 THEN id + 1 ELSE id - 1 END AS id, 
    student
FROM Seat 
WHERE id NOT IN (SELECT MAX(id) FROM Seat)
)
UNION 
(SELECT 
    CASE WHEN id % 2 != 0 THEN id ELSE id + 1 END AS id,
    student 
FROM Seat
WHERE id = (SELECT MAX(id) FROM Seat))
ORDER BY id

[(1, 'Doris'), (2, 'Abbot'), (3, 'Green'), (4, 'Emerson'), (5, 'Jeames')]

# Using Pandas

In [9]:
seat_query = %sql SELECT * FROM Seat # type: ignore
seat_df = seat_query.DataFrame()

display(seat_df)

   id  student
0   1    Abbot
1   2    Doris
2   3  Emerson
3   4    Green
4   5   Jeames